bibidentuhanoi/P4autoBoat/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
CONFIG_VL53L5CX_NB_TARGET_PER_ZONE=4
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=y
CONFIG_ESP_INT_WDT=y
CONFIG_ESP_INT_WDT_TIMEOUT_MS=2000
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=y
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=y
CONFIG_HTTPD_WS_SUPPORT=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_CAMERA_OV5647=y
CONFIG_CAMERA_OV5647_MIPI_RAW8_800X640_50FPS=y
CONFIG_CAMERA_OV5647_MIPI_DEFAULT_FMT_RAW8_800X640_50FPS=y
CONFIG_ESP_VIDEO_ENABLE_ISP_PIPELINE_CONTROLLER=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
# --- esp_hosted slave: ESP32-C6 over SDIO ---
# Seed BOTH the legacy and current choice-symbol names: kconfgen regens have
# been observed collapsing the slave-target choice to ESP32-H2 (a no-WiFi
# chip), which silently erases every WIFI_RMT_*/SDIO symbol from sdkconfig.
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_CP_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_P4_DEV_BOARD_FUNC_BOARD=y
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_WIFI_RMT_STATIC_RX_BUFFER_NUM=16
CONFIG_WIFI_RMT_DYNAMIC_RX_BUFFER_NUM=64
CONFIG_WIFI_RMT_DYNAMIC_TX_BUFFER_NUM=64
CONFIG_WIFI_RMT_AMPDU_TX_ENABLED=y
CONFIG_WIFI_RMT_TX_BA_WIN=32
CONFIG_WIFI_RMT_AMPDU_RX_ENABLED=y
CONFIG_WIFI_RMT_RX_BA_WIN=32

# --- LWIP tuning for stability over ESP-Hosted ---
# PSRAM fallback (SPIRAM_TRY_ALLOCATE_WIFI_LWIP) lets us use larger buffers
# without exhausting internal SRAM.  16KB absorbs ToF frame bursts (3-5KB
# at 20Hz) and avoids EAGAIN from buffer-full on flaky esp_hosted WiFi.
# Tested stable — no heap issues with 7 sockets × 16KB + PSRAM fallback.
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=8192
CONFIG_LWIP_TCP_WND_DEFAULT=8192
CONFIG_LWIP_TCP_RECVMBOX_SIZE=64
CONFIG_LWIP_UDP_RECVMBOX_SIZE=64
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=64
CONFIG_LWIP_TCPIP_TASK_STACK_SIZE=8192
CONFIG_LWIP_TCP_MSL=6000
CONFIG_LWIP_TCP_OVERSIZE_MSS=y

# --- Let lwip fall back to PSRAM when internal SRAM is tight ---
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# --- Heap poisoning (light) — catches corruption early, ~2% overhead ---
CONFIG_HEAP_POISONING_LIGHT=y

# --- Disable WiFi power save for lower latency / fewer drops ---
# (CONFIG_ESP_WIFI_PS_NONE is a dead symbol on esp_hosted — kconfgen warned
#  "unknown symbol" every regen. PS_NONE is applied at runtime instead via
#  esp_wifi_set_ps() in wifi_manager.c.)

# --- ESP-NOW field mode ---
CONFIG_ESPNOW_ENABLED=y
CONFIG_ESP_HOSTED_MAX_CUSTOM_MSG_HANDLERS=8
